Revit 2027 API
LevelAssociationData.GetAssociatedLevel Method
 Returns the Associated Level id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetAssociatedLevel()
Public Function GetAssociatedLevel As ElementId
public:
ElementId^ GetAssociatedLevel()
member GetAssociatedLevel : unit -> ElementId
Return Value
ElementId
See Also
Reference
LevelAssociationData Class
Autodesk.Revit.DB Namespace